kthunder/ch32v305_dap/User/SW_UDISK.c
/*******************************************************************************
* Function Name  : UDISK_Out_EP_Deal
* Description    : U盘下传端点处理
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UDISK_Out_EP_Deal( uint8_t *pbuf, uint16_t packlen )
{
    uint32_t i;
    /* 进行端点2下传数据处理 */
    if( Udisk_Transfer_Status & DEF_UDISK_BLUCK_DOWN_FLAG )
    {
        /* 处理下传的USB数据包 */
        UDISK_Down_OnePack( pbuf, packlen );
    }
    else
    {                                
        if( packlen == 0x1F )
        {
            for( i = 0; i < packlen; i++ ) 
            {
                mBOC.buf[ i ] = *pbuf++;
            }

            /* 进行SCSI命令包的处理 */
            UDISK_SCSI_CMD_Deal( );
            if( ( Udisk_Transfer_Status & DEF_UDISK_BLUCK_DOWN_FLAG ) == 0x00 )
            {
                if( Udisk_Transfer_Status & DEF_UDISK_BLUCK_UP_FLAG )
                {
                    if( mBOC.mCBW.mCBW_CB_Buf[ 0 ] == CMD_U_READ10 )
                    {
                        UDISK_Up_OnePack( );
                    }
                    else
                    {
                        UDISK_Bulk_UpData( );
                    }
                }
                else if( Udisk_CSW_Status == 0x00 )
                {
                    /* 上传CSW包 */
                    UDISK_Up_CSW(  );                     
                }                        
            }
        }
    }
}

/*******************************************************************************
* Function Name  : UDISK_Bulk_UpData
* Description    : 批量端点端点2上传数据包
* Input          : Transfer_DataLen--- 传输的数据长度
*                  *pBuf---数据地址指针
* Output         : Transfer_DataLen--- 传输的数据长度
*                  *pBuf---数据地址指针
* Return         : None
*******************************************************************************/
void UDISK_Bulk_UpData( void )
{                                            
    uint32_t  len;

    if( UDISK_Transfer_DataLen > UDISK_Pack_Size )
    {
        len = UDISK_Pack_Size;
        UDISK_Transfer_DataLen -= UDISK_Pack_Size;
    }
    else
    {
        len = UDISK_Transfer_DataLen;
        UDISK_Transfer_DataLen = 0x00;
        Udisk_Transfer_Status &= ~DEF_UDISK_BLUCK_UP_FLAG;        
    }

    /* 将数据装载进上传缓冲区中,并启动上传 */
    USBHS_Endp_DataUp(DEF_UEP2, pEndp2_Buf, len, DEF_UEP_CPY_LOAD );
}

/*******************************************************************************
* Function Name  : UDISK_Up_CSW
* Description    : 批量端点端点2上传CSW包
* Input          : CBW_Tag_Save---命令块标签
*                  CSW_Status---当前命令执行结果状态
* Output         : Bit_DISK_CSW---尚未上传过CSW包标志
*                  Bit_DISK_Bluck_Up---数据上传标志
*                  Bit_DISK_Bluck_Down---数据下传标志
* Return         : None
*******************************************************************************/
void UDISK_Up_CSW( void )
{
    Udisk_Transfer_Status = 0x00;

    mBOC.mCSW.mCSW_Sig[ 0 ] = 'U';
    mBOC.mCSW.mCSW_Sig[ 1 ] = 'S';
    mBOC.mCSW.mCSW_Sig[ 2 ] = 'B';
    mBOC.mCSW.mCSW_Sig[ 3 ] = 'S';
    mBOC.mCSW.mCSW_Tag[ 0 ] = Udisk_CBW_Tag_Save[ 0 ];
    mBOC.mCSW.mCSW_Tag[ 1 ] = Udisk_CBW_Tag_Save[ 1 ];
    mBOC.mCSW.mCSW_Tag[ 2 ] = Udisk_CBW_Tag_Save[ 2 ];
    mBOC.mCSW.mCSW_Tag[ 3 ] = Udisk_CBW_Tag_Save[ 3 ];
    mBOC.mCSW.mCSW_Residue[ 0 ] = 0x00;
    mBOC.mCSW.mCSW_Residue[ 1 ] = 0x00;
    mBOC.mCSW.mCSW_Residue[ 2 ] = 0x00;
    mBOC.mCSW.mCSW_Residue[ 3 ] = 0x00;
    mBOC.mCSW.mCSW_Status = Udisk_CSW_Status;

    /* 将数据装载进上传缓冲区中,并启动上传 */
    USBHS_Endp_DataUp(DEF_UEP2, (uint8_t *)mBOC.buf, 0x0D, DEF_UEP_CPY_LOAD );

}


#define SECTOR_SIZE      512
#define TOTAL_SECTORS    2048 // 1024KB = 2048扇区
#define SECTORS_PER_FAT  4    // FAT表需要4扇区
#define ROOT_DIR_SECTORS 4    // 根目录4扇区
#define RESERVED_SECTORS 1    // 保留扇区1个
#define DATA_START_LBA   9    // 1+4+4=9

const uint8_t BootSector[] = {
    0xEB, 0x3C, 0x90,
    'M', 'S', 'D', 'O', 'S', '5', '.', '0',
    0x00, 0x02,                             // 512字节/扇区
    0x01,                                   // 1扇区/簇
    0x01, 0x00,                             // 1个保留扇区
    0x01,                                   // 1个FAT表
    0x40, 0x00,                             // 64个根目录条目
    0x00, 0x08,                             // 2048扇区(0x0800小端序)
    0xF0,                                   // 媒体描述符
    0x04, 0x00,                             // 4扇区/FAT
    0x01, 0x00,                             // 扇区/磁道
    0x01, 0x00,                             // 磁头数
    0x00, 0x00, 0x00, 0x00,                 // 隐藏扇区
    0x00, 0x00, 0x00, 0x00,                 // 大扇区数
    0x00,                                   // 驱动器号
    0x00,                                   // 保留
    0x29,                                   // 签名
    0x12, 0x34, 0x56, 0x78,                 // 卷序列号
    'U', 'S', 'B', 'F', 'L', 'A', 'S', 'H', // 卷标
    'F', 'A', 'T', '1', '2', ' ', ' ', ' ', // 文件系统类型
    // [62 ... 509] = 0x00,// Boot code (fill with 0)
    // 0x55, 0xAA // Boot sector signature(write in func)
};


/*******************************************************************************
* Function Name  : UDISK_Up_OnePack
* Description    : USB存储设备上传一包数据
*                  该函数在U盘读扇区命令时使用,每次上传一包数据后,根据需要在中断中在
*                  考虑是否继续上传
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UDISK_Up_OnePack( void )
{    
    /* 判断是否需要发起读扇区命令 */
    uint8_t buffer[512] = {0};
    uint8_t sector = UDISK_Cur_Sec_Lba;

#if (STORAGE_MEDIUM == MEDIUM_SPI_FLASH)
    if( UDISK_Sec_Pack_Count == 0x00 )     
    {
        FLASH_RD_Block_Start( UDISK_Cur_Sec_Lba * DEF_UDISK_SECTOR_SIZE );
    }
    FLASH_RD_Block( UDisk_Pack_Buffer, UDISK_Pack_Size );
    pbuf = UDisk_Pack_Buffer;
#elif (STORAGE_MEDIUM == MEDIUM_INTERAL_FLASH)
    // pbuf = (uint8_t*)(IFLASH_UDISK_START_ADDR + UDISK_Cur_Sec_Lba * DEF_UDISK_SECTOR_SIZE + UDISK_Pack_Size * UDISK_Sec_Pack_Count);
    if (sector == 0) {
        memcpy(buffer, BootSector, sizeof(BootSector));
        buffer[510] = 0x55;
        buffer[511] = 0xAA;
    } else if (sector >= 1 && sector <= 4) { // FAT表扇区1-4
        memset(buffer, 0, SECTOR_SIZE);
        if (sector == 1) {
            buffer[0] = 0xF0;
            buffer[1] = 0xFF;
            buffer[2] = 0xFF;
        }
    } else if (sector >= 5) {
        memset(buffer, 0, SECTOR_SIZE);
    }
#endif

    /* USB上传本包数据 */
    USBHS_Endp_DataUp(DEF_UEP2, buffer+UDISK_Pack_Size * UDISK_Sec_Pack_Count,UDISK_Pack_Size, DEF_UEP_CPY_LOAD );

    /* 判断当前扇区数据是否读取上传完毕 */
    UDISK_Sec_Pack_Count++;
    UDISK_Transfer_DataLen -= UDISK_Pack_Size;

