kthunder/ch32v305_dap/User/SW_UDISK.c
    if( UDISK_Sec_Pack_Count == ( DEF_UDISK_SECTOR_SIZE / UDISK_Pack_Size ) )
    {
#if (STORAGE_MEDIUM == MEDIUM_SPI_FLASH)
        PIN_FLASH_CS_HIGH( );
#endif
        UDISK_Sec_Pack_Count = 0x00;
        UDISK_Cur_Sec_Lba++;
    }
    /* 判断数据是否全部上传完毕 */    
     if( UDISK_Transfer_DataLen == 0x00 )
    {    
        Udisk_Transfer_Status &= ~DEF_UDISK_BLUCK_UP_FLAG;
    }
}

bool flash_start = false;
uint32_t flash_timer = 0;
/*******************************************************************************
* Function Name  : UDISK_Down_OnePack
* Description    : USB存储设备处理一包下传数据
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UDISK_Down_OnePack( uint8_t *pbuf, uint16_t packlen )
{
    uint32_t address;
    uint32_t sec_start_addr;
    if( UDISK_Sec_Pack_Count == 0x00 )
    {
        address = (uint32_t)UDISK_Cur_Sec_Lba * DEF_UDISK_SECTOR_SIZE;
        sec_start_addr = ( address / DEF_FLASH_SECTOR_SIZE ) * DEF_FLASH_SECTOR_SIZE;
#if (STORAGE_MEDIUM == MEDIUM_SPI_FLASH)
        FLASH_Erase_Sector(sec_start_addr);
#endif
    }
    memcpy(UDisk_Down_Buffer + (uint32_t)UDISK_Sec_Pack_Count * UDISK_Pack_Size ,pbuf, UDISK_Pack_Size);
    UDISK_Sec_Pack_Count++;
    UDISK_Transfer_DataLen -= UDISK_Pack_Size;

    if( UDISK_Sec_Pack_Count == ( DEF_UDISK_SECTOR_SIZE / UDISK_Pack_Size ) )
    {
        address = (uint32_t)UDISK_Cur_Sec_Lba * DEF_UDISK_SECTOR_SIZE;
        sec_start_addr = ( address / DEF_FLASH_SECTOR_SIZE ) * DEF_FLASH_SECTOR_SIZE;

#if (STORAGE_MEDIUM == MEDIUM_SPI_FLASH)
        W25XXX_WR_Block(UDisk_Down_Buffer, sec_start_addr, DEF_FLASH_SECTOR_SIZE );
#elif (STORAGE_MEDIUM == MEDIUM_INTERAL_FLASH)
        // IFlash_Prog_512(IFLASH_UDISK_START_ADDR + sec_start_addr,(uint32_t*)UDisk_Down_Buffer);
        if (UDISK_Cur_Sec_Lba<12) {
            memcpy(IFLASH_UDISK_START_ADDR + sec_start_addr, UDisk_Down_Buffer, 512);
        }else {
            // printf("sec %d\r\n", UDISK_Cur_Sec_Lba);
            // uint32_t x = 0;
            // for (int i=0; i<512; i++) {
            //     if (i<=32) {
            //         printf("0x%02X ", UDisk_Down_Buffer[i]);
            //     }
            //     x += UDisk_Down_Buffer[i];
            // }
            // printf("\r\naddr 0x%08X\r\n", 0x08002000+(UDISK_Cur_Sec_Lba-12)*DEF_FLASH_SECTOR_SIZE);
            flash_start = 1;
            flash_timer = sys_time_ms();
            IFlash_Prog_512(0x08002000+(UDISK_Cur_Sec_Lba-12)*DEF_FLASH_SECTOR_SIZE,(uint32_t*)UDisk_Down_Buffer);
        }
#endif
        /* 判断数据是否全部下传完毕 */
        if( UDISK_Transfer_DataLen == 0x00 )
        {
            Udisk_Transfer_Status &= ~DEF_UDISK_BLUCK_DOWN_FLAG;
            UDISK_Up_CSW( );
        }
        UDISK_Sec_Pack_Count = 0x00;
        UDISK_Cur_Sec_Lba++;
    }
}
